zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT1189/drivers/fsl_clock.h
/*! @brief Clock ip name array for USB. */
#define USB_CLOCKS \
    {              \
        kCLOCK_Usb \
    }

/*! @brief Clock ip name array for USDHC. */
#define USDHC_CLOCKS                                   \
    {                                                  \
        kCLOCK_IpInvalid, kCLOCK_Usdhc1, kCLOCK_Usdhc2 \
    }

/*! @brief Clock gate name array for WDOG. */
#define WDOG_CLOCKS                                                                            \
    {                                                                                          \
        kCLOCK_IpInvalid, kCLOCK_Wdog1, kCLOCK_Wdog2, kCLOCK_Wdog3, kCLOCK_Wdog4, kCLOCK_Wdog5 \
    }

/*! @brief Clock ip name array for XBAR. */
#define XBAR_CLOCKS                                                \
    {                                                              \
        kCLOCK_IpInvalid, kCLOCK_Xbar1, kCLOCK_Xbar2, kCLOCK_Xbar3 \
    }

/*!
 * @brief Clock LPCG index
 */
typedef enum _clock_lpcg
{
    kCLOCK_M7          = 0,   /*!< Clock LPCG M7          */
    kCLOCK_M33         = 1,   /*!< Clock LPCG M33         */
    kCLOCK_Edgelock    = 2,   /*!< Clock LPCG Edgelock    */
    kCLOCK_Sim_Aon     = 3,   /*!< Clock LPCG Sim_Aon     */
    kCLOCK_Sim_Wakeup  = 4,   /*!< Clock LPCG Sim_Wakeup  */
    kCLOCK_Sim_Mega    = 5,   /*!< Clock LPCG Sim_Mega    */
    kCLOCK_Sim_R       = 6,   /*!< Clock LPCG Sim_R       */
    kCLOCK_Anadig      = 7,   /*!< Clock LPCG Anadig      */
    kCLOCK_Dcdc        = 8,   /*!< Clock LPCG Dcdc        */
    kCLOCK_Src         = 9,   /*!< Clock LPCG Src         */
    kCLOCK_Ccm         = 10,  /*!< Clock LPCG Ccm         */
    kCLOCK_Gpc         = 11,  /*!< Clock LPCG Gpc         */
    kCLOCK_Adc1        = 12,  /*!< Clock LPCG Adc1        */
    kCLOCK_Adc2        = 13,  /*!< Clock LPCG Adc2        */
    kCLOCK_Dac         = 14,  /*!< Clock LPCG Dac         */
    kCLOCK_Acmp1       = 15,  /*!< Clock LPCG Acmp1       */
    kCLOCK_Acmp2       = 16,  /*!< Clock LPCG Acmp2       */
    kCLOCK_Acmp3       = 17,  /*!< Clock LPCG Acmp3       */
    kCLOCK_Acmp4       = 18,  /*!< Clock LPCG Acmp4       */
    kCLOCK_Wdog1       = 19,  /*!< Clock LPCG Wdog1       */
    kCLOCK_Wdog2       = 20,  /*!< Clock LPCG Wdog2       */
    kCLOCK_Wdog3       = 21,  /*!< Clock LPCG Wdog3       */
    kCLOCK_Wdog4       = 22,  /*!< Clock LPCG Wdog4       */
    kCLOCK_Wdog5       = 23,  /*!< Clock LPCG Wdog5       */
    kCLOCK_Ewm0        = 24,  /*!< Clock LPCG Ewm0        */
    kCLOCK_Sema1       = 25,  /*!< Clock LPCG Sema1       */
    kCLOCK_Sema2       = 26,  /*!< Clock LPCG Sema2       */
    kCLOCK_Mu_A        = 27,  /*!< Clock LPCG Mu_A        */
    kCLOCK_Mu_B        = 28,  /*!< Clock LPCG Mu_B        */
    kCLOCK_Edma3       = 29,  /*!< Clock LPCG Edma3       */
    kCLOCK_Edma4       = 30,  /*!< Clock LPCG Edma4       */
    kCLOCK_Romcp       = 31,  /*!< Clock LPCG Romcp       */
    kCLOCK_Ocram1      = 32,  /*!< Clock LPCG Ocram1      */
    kCLOCK_Ocram2      = 33,  /*!< Clock LPCG Ocram2      */
    kCLOCK_Flexspi1    = 34,  /*!< Clock LPCG Flexspi1    */
    kCLOCK_Flexspi2    = 35,  /*!< Clock LPCG Flexspi2    */
    kCLOCK_Flexspi_Slv = 36,  /*!< Clock LPCG Flexspi_Slv */
    kCLOCK_Trdc        = 37,  /*!< Clock LPCG Trdc        */
    kCLOCK_Ocotp       = 38,  /*!< Clock LPCG Ocotp       */
    kCLOCK_Semc        = 39,  /*!< Clock LPCG Semc        */
    kCLOCK_Iee         = 40,  /*!< Clock LPCG Iee         */
    kCLOCK_Cstrace     = 41,  /*!< Clock LPCG Cstrace     */
    kCLOCK_Csswo       = 42,  /*!< Clock LPCG Csswo       */
    kCLOCK_Iomuxc1     = 43,  /*!< Clock LPCG Iomuxc1     */
    kCLOCK_Iomuxc2     = 44,  /*!< Clock LPCG Iomuxc2     */
    kCLOCK_Gpio1       = 45,  /*!< Clock LPCG Gpio1       */
    kCLOCK_Gpio2       = 46,  /*!< Clock LPCG Gpio2       */
    kCLOCK_Gpio3       = 47,  /*!< Clock LPCG Gpio3       */
    kCLOCK_Gpio4       = 48,  /*!< Clock LPCG Gpio4       */
    kCLOCK_Gpio5       = 49,  /*!< Clock LPCG Gpio5       */
    kCLOCK_Gpio6       = 50,  /*!< Clock LPCG Gpio6       */
    kCLOCK_Flexio1     = 51,  /*!< Clock LPCG Flexio1     */
    kCLOCK_Flexio2     = 52,  /*!< Clock LPCG Flexio2     */
    kCLOCK_Lpit1       = 53,  /*!< Clock LPCG Lpit1       */
    kCLOCK_Lpit2       = 54,  /*!< Clock LPCG Lpit2       */
    kCLOCK_Lpit3       = 55,  /*!< Clock LPCG Lpit3       */
    kCLOCK_Lptmr1      = 56,  /*!< Clock LPCG Lptmr1      */
    kCLOCK_Lptmr2      = 57,  /*!< Clock LPCG Lptmr2      */
    kCLOCK_Lptmr3      = 58,  /*!< Clock LPCG Lptmr3      */
    kCLOCK_Tpm1        = 59,  /*!< Clock LPCG Tpm1        */
    kCLOCK_Tpm2        = 60,  /*!< Clock LPCG Tpm2        */
    kCLOCK_Tpm3        = 61,  /*!< Clock LPCG Tpm3        */
    kCLOCK_Tpm4        = 62,  /*!< Clock LPCG Tpm4        */
    kCLOCK_Tpm5        = 63,  /*!< Clock LPCG Tpm5        */
    kCLOCK_Tpm6        = 64,  /*!< Clock LPCG Tpm6        */
    kCLOCK_Qtimer1     = 65,  /*!< Clock LPCG Qtimer1     */
    kCLOCK_Qtimer2     = 66,  /*!< Clock LPCG Qtimer2     */
    kCLOCK_Qtimer3     = 67,  /*!< Clock LPCG Qtimer3     */
    kCLOCK_Qtimer4     = 68,  /*!< Clock LPCG Qtimer4     */
    kCLOCK_Qtimer5     = 69,  /*!< Clock LPCG Qtimer5     */
    kCLOCK_Qtimer6     = 70,  /*!< Clock LPCG Qtimer6     */
    kCLOCK_Qtimer7     = 71,  /*!< Clock LPCG Qtimer7     */
    kCLOCK_Qtimer8     = 72,  /*!< Clock LPCG Qtimer8     */
    kCLOCK_Gpt1        = 73,  /*!< Clock LPCG Gpt1        */
    kCLOCK_Gpt2        = 74,  /*!< Clock LPCG Gpt2        */
    kCLOCK_Syscount    = 75,  /*!< Clock LPCG Syscount    */
    kCLOCK_Can1        = 76,  /*!< Clock LPCG Can1        */
    kCLOCK_Can2        = 77,  /*!< Clock LPCG Can2        */
    kCLOCK_Can3        = 78,  /*!< Clock LPCG Can3        */
    kCLOCK_Lpuart1     = 79,  /*!< Clock LPCG Lpuart1     */
    kCLOCK_Lpuart2     = 80,  /*!< Clock LPCG Lpuart2     */
    kCLOCK_Lpuart3     = 81,  /*!< Clock LPCG Lpuart3     */
    kCLOCK_Lpuart4     = 82,  /*!< Clock LPCG Lpuart4     */
    kCLOCK_Lpuart5     = 83,  /*!< Clock LPCG Lpuart5     */
    kCLOCK_Lpuart6     = 84,  /*!< Clock LPCG Lpuart6     */
    kCLOCK_Lpuart7     = 85,  /*!< Clock LPCG Lpuart7     */
    kCLOCK_Lpuart8     = 86,  /*!< Clock LPCG Lpuart8     */
    kCLOCK_Lpuart9     = 87,  /*!< Clock LPCG Lpuart9     */
    kCLOCK_Lpuart10    = 88,  /*!< Clock LPCG Lpuart10    */
    kCLOCK_Lpuart11    = 89,  /*!< Clock LPCG Lpuart11    */
    kCLOCK_Lpuart12    = 90,  /*!< Clock LPCG Lpuart12    */
    kCLOCK_Lpi2c1      = 91,  /*!< Clock LPCG Lpi2c1      */
    kCLOCK_Lpi2c2      = 92,  /*!< Clock LPCG Lpi2c2      */
    kCLOCK_Lpi2c3      = 93,  /*!< Clock LPCG Lpi2c3      */
    kCLOCK_Lpi2c4      = 94,  /*!< Clock LPCG Lpi2c4      */
    kCLOCK_Lpi2c5      = 95,  /*!< Clock LPCG Lpi2c5      */
    kCLOCK_Lpi2c6      = 96,  /*!< Clock LPCG Lpi2c6      */
    kCLOCK_Lpspi1      = 97,  /*!< Clock LPCG Lpspi1      */
    kCLOCK_Lpspi2      = 98,  /*!< Clock LPCG Lpspi2      */
    kCLOCK_Lpspi3      = 99,  /*!< Clock LPCG Lpspi3      */
    kCLOCK_Lpspi4      = 100, /*!< Clock LPCG Lpspi4      */
    kCLOCK_Lpspi5      = 101, /*!< Clock LPCG Lpspi5      */
    kCLOCK_Lpspi6      = 102, /*!< Clock LPCG Lpspi6      */
    kCLOCK_I3c1        = 103, /*!< Clock LPCG I3c1        */
    kCLOCK_I3c2        = 104, /*!< Clock LPCG I3c2        */
    kCLOCK_Usdhc1      = 105, /*!< Clock LPCG Usdhc1      */
    kCLOCK_Usdhc2      = 106, /*!< Clock LPCG Usdhc2      */
    kCLOCK_Usb         = 107, /*!< Clock LPCG Usb         */
    kCLOCK_Sinc1       = 108, /*!< Clock LPCG Sinc1       */
    kCLOCK_Sinc2       = 109, /*!< Clock LPCG Sinc2       */
    kCLOCK_Sinc3       = 110, /*!< Clock LPCG Sinc3       */
    kCLOCK_Xbar1       = 111, /*!< Clock LPCG Xbar1       */
    kCLOCK_Xbar2       = 112, /*!< Clock LPCG Xbar2       */
    kCLOCK_Xbar3       = 113, /*!< Clock LPCG Xbar3       */
    kCLOCK_Aoi1        = 114, /*!< Clock LPCG Aoi1        */
    kCLOCK_Aoi2        = 115, /*!< Clock LPCG Aoi2        */
    kCLOCK_Aoi3        = 116, /*!< Clock LPCG Aoi3        */
    kCLOCK_Aoi4        = 117, /*!< Clock LPCG Aoi4        */
    kCLOCK_Enc1        = 118, /*!< Clock LPCG Enc1        */
    kCLOCK_Enc2        = 119, /*!< Clock LPCG Enc2        */
    kCLOCK_Enc3        = 120, /*!< Clock LPCG Enc3        */
    kCLOCK_Enc4        = 121, /*!< Clock LPCG Enc4        */
    kCLOCK_Kpp         = 122, /*!< Clock LPCG Kpp         */
    kCLOCK_Pwm1        = 123, /*!< Clock LPCG Pwm1        */
    kCLOCK_Pwm2        = 124, /*!< Clock LPCG Pwm2        */
    kCLOCK_Pwm3        = 125, /*!< Clock LPCG Pwm3        */
    kCLOCK_Pwm4        = 126, /*!< Clock LPCG Pwm4        */
    kCLOCK_Ecat        = 127, /*!< Clock LPCG Ecat        */
    kCLOCK_Netc        = 128, /*!< Clock LPCG Netc        */
    kCLOCK_Serdes1     = 129, /*!< Clock LPCG Serdes1     */
    kCLOCK_Serdes2     = 130, /*!< Clock LPCG Serdes2     */
    kCLOCK_Serdes3     = 131, /*!< Clock LPCG Serdes3     */
    kCLOCK_Xcelbusx    = 132, /*!< Clock LPCG Xcelbusx    */
    kCLOCK_Xriocu4     = 133, /*!< Clock LPCG Xriocu4     */
    kCLOCK_Sptp        = 134, /*!< Clock LPCG Sptp        */
    kCLOCK_Mctrl       = 135, /*!< Clock LPCG Mctrl       */
    kCLOCK_Sai1        = 136, /*!< Clock LPCG Sai1        */
    kCLOCK_Sai2        = 137, /*!< Clock LPCG Sai2        */
    kCLOCK_Sai3        = 138, /*!< Clock LPCG Sai3        */
    kCLOCK_Sai4        = 139, /*!< Clock LPCG Sai4        */
    kCLOCK_Spdif       = 140, /*!< Clock LPCG Spdif       */
    kCLOCK_Asrc        = 141, /*!< Clock LPCG Asrc        */
    kCLOCK_Pdm         = 142, /*!< Clock LPCG Mic         */
    kCLOCK_Vref        = 143, /*!< Clock LPCG Vref        */
    kCLOCK_Bist        = 144, /*!< Clock LPCG Bist        */
    kCLOCK_Ssi_W2M7    = 145, /*!< Clock LPCG Ssi_W2M7    */
    kCLOCK_Ssi_M72W    = 146, /*!< Clock LPCG Ssi_M72W    */
    kCLOCK_Ssi_W2Ao    = 147, /*!< Clock LPCG Ssi_W2Ao    */
    kCLOCK_Ssi_Ao2W    = 148, /*!< Clock LPCG Ssi_Ao2W    */

    kCLOCK_IpInvalid, /*!< Invalid value. */
} clock_lpcg_t;

/*!
 * @brief Clock name.
 */
typedef enum _clock_name
{
    kCLOCK_OscRc24M    = 0,  /*!< 24MHz RC Oscillator. */
    kCLOCK_OscRc400M   = 1,  /*!< 400MHz RC Oscillator. */
    kCLOCK_Osc24M      = 2,  /*!< 24MHz Oscillator. */
    kCLOCK_Osc24MOut   = 3,  /*!< 24MHz Oscillator Out. */
    kCLOCK_ArmPll      = 4,  /*!< ARM PLL. */
    kCLOCK_ArmPllOut   = 5,  /*!< ARM PLL Out. */
    kCLOCK_SysPll2     = 6,  /*!< SYS PLL2. */
    kCLOCK_SysPll2Out  = 7,  /*!< SYS PLL2 OUT. */
    kCLOCK_SysPll2Pfd0 = 8,  /*!< SYS PLL2 PFD0. */
    kCLOCK_SysPll2Pfd1 = 9,  /*!< SYS PLL2 PFD1. */
    kCLOCK_SysPll2Pfd2 = 10, /*!< SYS PLL2 PFD2. */
    kCLOCK_SysPll2Pfd3 = 11, /*!< SYS PLL2 PFD3. */
    kCLOCK_SysPll3     = 12, /*!< SYS PLL3. */
    kCLOCK_SysPll3Out  = 13, /*!< SYS PLL3 OUT. */
    kCLOCK_SysPll3Div2 = 14, /*!< SYS PLL3 DIV2 */
    kCLOCK_SysPll3Pfd0 = 15, /*!< SYS PLL3 PFD0. */
    kCLOCK_SysPll3Pfd1 = 16, /*!< SYS PLL3 PFD1 */
    kCLOCK_SysPll3Pfd2 = 17, /*!< SYS PLL3 PFD2 */
    kCLOCK_SysPll3Pfd3 = 18, /*!< SYS PLL3 PFD3 */
    kCLOCK_SysPll1     = 19, /*!< SYS PLL1. */
    kCLOCK_SysPll1Out  = 20, /*!< SYS PLL1 OUT. */
    kCLOCK_SysPll1Div2 = 21, /*!< SYS PLL1 DIV2. */
    kCLOCK_SysPll1Div5 = 22, /*!< SYS PLL1 DIV5. */
    kCLOCK_AudioPll    = 23, /*!< SYS AUDIO PLL. */
    kCLOCK_AudioPllOut = 24, /*!< SYS AUDIO PLL OUT. */
    kCLOCK_CpuClk,           /*!< SYS CPU CLK. */
    kCLOCK_CoreSysClk,       /*!< SYS CORE SYS CLK. */
} clock_name_t;

/* Clock OBSERVE SIGNALS */
#define CCM_OBS_OSC_RC_24M           2
#define CCM_OBS_OSC_RC_400M          3
#define CCM_OBS_OSC_24M_OUT          5
#define CCM_OBS_PLL_ARM_OUT          7
#define CCM_OBS_PLL_528_OUT          9
#define CCM_OBS_PLL_528_PFD0         10
#define CCM_OBS_PLL_528_PFD1         11
#define CCM_OBS_PLL_528_PFD2         12
#define CCM_OBS_PLL_528_PFD3         13
#define CCM_OBS_PLL_480_OUT          15
#define CCM_OBS_PLL_480_DIV2         16
#define CCM_OBS_PLL_480_PFD0         17
#define CCM_OBS_PLL_480_PFD1         18
#define CCM_OBS_PLL_480_PFD2         19
#define CCM_OBS_PLL_480_PFD3         20
#define CCM_OBS_PLL_1G_OUT           22
#define CCM_OBS_PLL_1G_DIV2          23
#define CCM_OBS_PLL_1G_DIV5          24
#define CCM_OBS_PLL_AUDIO_OUT        26
#define CCM_OBS_M7_CLK_ROOT          128
#define CCM_OBS_M33_CLK_ROOT         129
#define CCM_OBS_EDGELOCK_CLK_ROOT    130
#define CCM_OBS_BUS_AON_CLK_ROOT     131
#define CCM_OBS_BUS_WAKEUP_CLK_ROOT  132
#define CCM_OBS_WAKEUP_AXI_CLK_ROOT  133
#define CCM_OBS_SWO_TRACE_CLK_ROOT   134
#define CCM_OBS_M33_SYSTICK_CLK_ROOT 135
#define CCM_OBS_M7_SYSTICK_CLK_ROOT  136
#define CCM_OBS_FLEXIO1_CLK_ROOT     137
#define CCM_OBS_FLEXIO2_CLK_ROOT     138
#define CCM_OBS_LPIT3_CLK_ROOT       139
#define CCM_OBS_LPTMR1_CLK_ROOT      140
#define CCM_OBS_LPTMR2_CLK_ROOT      141
#define CCM_OBS_LPTMR3_CLK_ROOT      142
#define CCM_OBS_TPM2_CLK_ROOT        143
#define CCM_OBS_TPM4_CLK_ROOT        144
#define CCM_OBS_TPM5_CLK_ROOT        145
#define CCM_OBS_TPM6_CLK_ROOT        146
#define CCM_OBS_GPT1_CLK_ROOT        147
#define CCM_OBS_GPT2_CLK_ROOT        148
#define CCM_OBS_FLEXSPI1_CLK_ROOT    149
#define CCM_OBS_FLEXSPI2_CLK_ROOT    150
#define CCM_OBS_FLEXSPI_SLV_CLK_ROOT 151
#define CCM_OBS_CAN1_CLK_ROOT        152
#define CCM_OBS_CAN2_CLK_ROOT        153
#define CCM_OBS_CAN3_CLK_ROOT        154
#define CCM_OBS_LPUART0102_CLK_ROOT  155
#define CCM_OBS_LPUART0304_CLK_ROOT  156
#define CCM_OBS_LPUART0506_CLK_ROOT  157
#define CCM_OBS_LPUART0708_CLK_ROOT  158
#define CCM_OBS_LPUART0910_CLK_ROOT  159
#define CCM_OBS_LPUART1112_CLK_ROOT  160
#define CCM_OBS_LPI2C0102_CLK_ROOT   161
#define CCM_OBS_LPI2C0304_CLK_ROOT   162
#define CCM_OBS_LPI2C0506_CLK_ROOT   163
#define CCM_OBS_LPSPI0102_CLK_ROOT   164
#define CCM_OBS_LPSPI0304_CLK_ROOT   165
#define CCM_OBS_LPSPI0506_CLK_ROOT   166
#define CCM_OBS_I3C1_CLK_ROOT        167
#define CCM_OBS_I3C2_CLK_ROOT        168
#define CCM_OBS_USDHC1_CLK_ROOT      169
#define CCM_OBS_USDHC2_CLK_ROOT      170
#define CCM_OBS_SEMC_CLK_ROOT        171
#define CCM_OBS_ADC1_CLK_ROOT        172
#define CCM_OBS_ADC2_CLK_ROOT        173
#define CCM_OBS_ACMP_CLK_ROOT        174
#define CCM_OBS_ECAT_CLK_ROOT        175
#define CCM_OBS_ENET_REFCLK_ROOT     176
#define CCM_OBS_TMR_1588_CLK_ROOT    177
#define CCM_OBS_NETC_CLK_ROOT        178
#define CCM_OBS_MAC0_CLK_ROOT        179
#define CCM_OBS_MAC1_CLK_ROOT        180
#define CCM_OBS_MAC2_CLK_ROOT        181
#define CCM_OBS_MAC3_CLK_ROOT        182
#define CCM_OBS_MAC4_CLK_ROOT        183
#define CCM_OBS_SERDES0_CLK_ROOT     184
#define CCM_OBS_SERDES1_CLK_ROOT     185
#define CCM_OBS_SERDES2_CLK_ROOT     186
#define CCM_OBS_SERDES0_1G_CLK_ROOT  187
#define CCM_OBS_SERDES1_1G_CLK_ROOT  188
#define CCM_OBS_SERDES2_1G_CLK_ROOT  189
#define CCM_OBS_XCELBUSX_CLK_ROOT    190
#define CCM_OBS_XRIOCU4_CLK_ROOT     191
#define CCM_OBS_MOTORCTRL_CLK_ROOT   192
#define CCM_OBS_SAI1_CLK_ROOT        193
#define CCM_OBS_SAI2_CLK_ROOT        194
#define CCM_OBS_SAI3_CLK_ROOT        195
#define CCM_OBS_SAI4_CLK_ROOT        196
#define CCM_OBS_SPDIF_CLK_ROOT       197
#define CCM_OBS_ASRC_CLK_ROOT        198
#define CCM_OBS_MIC_CLK_ROOT         199
#define CCM_OBS_CCM_CKO1_CLK_ROOT    200
#define CCM_OBS_CCM_CKO2_CLK_ROOT    201

#define CCM_OBS_DIV 3

extern const clock_name_t s_clockSourceName[][4];

/*!
 * @brief Root clock index
 *
 */
typedef enum _clock_root
{
    kCLOCK_Root_M7          = 0,  /*!< CLOCK Root M7          */
    kCLOCK_Root_M33         = 1,  /*!< CLOCK Root M33         */
    kCLOCK_Root_Edgelock    = 2,  /*!< CLOCK Root Edgelock    */
    kCLOCK_Root_Bus_Aon     = 3,  /*!< CLOCK Root Bus_Aon     */
    kCLOCK_Root_Bus_Wakeup  = 4,  /*!< CLOCK Root Bus_Wakeup  */
    kCLOCK_Root_Wakeup_Axi  = 5,  /*!< CLOCK Root Wakeup_Axi  */
    kCLOCK_Root_Swo_Trace   = 6,  /*!< CLOCK Root Swo_Trace   */
    kCLOCK_Root_M33_Systick = 7,  /*!< CLOCK Root M33_Systick */
    kCLOCK_Root_M7_Systick  = 8,  /*!< CLOCK Root M7_Systick  */
    kCLOCK_Root_Flexio1     = 9,  /*!< CLOCK Root Flexio1     */
    kCLOCK_Root_Flexio2     = 10, /*!< CLOCK Root Flexio2     */
    kCLOCK_Root_Lpit3       = 11, /*!< CLOCK Root Lpit3       */
    kCLOCK_Root_Lptimer1    = 12, /*!< CLOCK Root Lptimer1    */
    kCLOCK_Root_Lptimer2    = 13, /*!< CLOCK Root Lptimer2    */
    kCLOCK_Root_Lptimer3    = 14, /*!< CLOCK Root Lptimer3    */
    kCLOCK_Root_Tpm2        = 15, /*!< CLOCK Root Tpm2        */
    kCLOCK_Root_Tpm4        = 16, /*!< CLOCK Root Tpm4        */
    kCLOCK_Root_Tpm5        = 17, /*!< CLOCK Root Tpm5        */
    kCLOCK_Root_Tpm6        = 18, /*!< CLOCK Root Tpm6        */
    kCLOCK_Root_Gpt1        = 19, /*!< CLOCK Root Gpt1        */
    kCLOCK_Root_Gpt2        = 20, /*!< CLOCK Root Gpt2        */
    kCLOCK_Root_Flexspi1    = 21, /*!< CLOCK Root Flexspi1    */
    kCLOCK_Root_Flexspi2    = 22, /*!< CLOCK Root Flexspi2    */
    kCLOCK_Root_Flexspi_Slv = 23, /*!< CLOCK Root Flexspi_Slv */
    kCLOCK_Root_Can1        = 24, /*!< CLOCK Root Can1        */
    kCLOCK_Root_Can2        = 25, /*!< CLOCK Root Can2        */
    kCLOCK_Root_Can3        = 26, /*!< CLOCK Root Can3        */
    kCLOCK_Root_Lpuart0102  = 27, /*!< CLOCK Root Lpuart0102  */
    kCLOCK_Root_Lpuart0304  = 28, /*!< CLOCK Root Lpuart0304  */
    kCLOCK_Root_Lpuart0506  = 29, /*!< CLOCK Root Lpuart0506  */
    kCLOCK_Root_Lpuart0708  = 30, /*!< CLOCK Root Lpuart0708  */
    kCLOCK_Root_Lpuart0910  = 31, /*!< CLOCK Root Lpuart0910  */
    kCLOCK_Root_Lpuart1112  = 32, /*!< CLOCK Root Lpuart1112  */
    kCLOCK_Root_Lpi2c0102   = 33, /*!< CLOCK Root Lpi2c0102   */
    kCLOCK_Root_Lpi2c0304   = 34, /*!< CLOCK Root Lpi2c0304   */
    kCLOCK_Root_Lpi2c0506   = 35, /*!< CLOCK Root Lpi2c0506   */
    kCLOCK_Root_Lpspi0102   = 36, /*!< CLOCK Root Lpspi0102   */
    kCLOCK_Root_Lpspi0304   = 37, /*!< CLOCK Root Lpspi0304   */
    kCLOCK_Root_Lpspi0506   = 38, /*!< CLOCK Root Lpspi0506   */
    kCLOCK_Root_I3c1        = 39, /*!< CLOCK Root I3c1        */
    kCLOCK_Root_I3c2        = 40, /*!< CLOCK Root I3c2        */
    kCLOCK_Root_Usdhc1      = 41, /*!< CLOCK Root Usdhc1      */
    kCLOCK_Root_Usdhc2      = 42, /*!< CLOCK Root Usdhc2      */
    kCLOCK_Root_Semc        = 43, /*!< CLOCK Root Semc        */
    kCLOCK_Root_Adc1        = 44, /*!< CLOCK Root Adc1        */
    kCLOCK_Root_Adc2        = 45, /*!< CLOCK Root Adc2        */
    kCLOCK_Root_Acmp        = 46, /*!< CLOCK Root Acmp        */
    kCLOCK_Root_Ecat        = 47, /*!< CLOCK Root Ecat        */
    kCLOCK_Root_Enet        = 48, /*!< CLOCK Root Enet        */
    kCLOCK_Root_Tmr_1588    = 49, /*!< CLOCK Root Tmr_1588    */
    kCLOCK_Root_Netc        = 50, /*!< CLOCK Root Netc        */
    kCLOCK_Root_Mac0        = 51, /*!< CLOCK Root Mac0        */
    kCLOCK_Root_Mac1        = 52, /*!< CLOCK Root Mac1        */
    kCLOCK_Root_Mac2        = 53, /*!< CLOCK Root Mac2        */
    kCLOCK_Root_Mac3        = 54, /*!< CLOCK Root Mac3        */
    kCLOCK_Root_Mac4        = 55, /*!< CLOCK Root Mac4        */
    kCLOCK_Root_Serdes0     = 56, /*!< CLOCK Root Serdes0     */
    kCLOCK_Root_Serdes1     = 57, /*!< CLOCK Root Serdes1     */
    kCLOCK_Root_Serdes2     = 58, /*!< CLOCK Root Serdes2     */
    kCLOCK_Root_Serdes0_1G  = 59, /*!< CLOCK Root Serdes0_1G  */
    kCLOCK_Root_Serdes1_1G  = 60, /*!< CLOCK Root Serdes1_1G  */
    kCLOCK_Root_Serdes2_1G  = 61, /*!< CLOCK Root Serdes2_1G  */
    kCLOCK_Root_Xcelbusx    = 62, /*!< CLOCK Root Xcelbusx    */
    kCLOCK_Root_Xriocu4     = 63, /*!< CLOCK Root Xriocu4     */
    kCLOCK_Root_Mctrl       = 64, /*!< CLOCK Root Mctrl       */
    kCLOCK_Root_Sai1        = 65, /*!< CLOCK Root Sai1        */
    kCLOCK_Root_Sai2        = 66, /*!< CLOCK Root Sai2        */
    kCLOCK_Root_Sai3        = 67, /*!< CLOCK Root Sai3        */
    kCLOCK_Root_Sai4        = 68, /*!< CLOCK Root Sai4        */
    kCLOCK_Root_Spdif       = 69, /*!< CLOCK Root Spdif       */
    kCLOCK_Root_Asrc        = 70, /*!< CLOCK Root Asrc        */
    kCLOCK_Root_Mic         = 71, /*!< CLOCK Root Mic         */
    kCLOCK_Root_Cko1        = 72, /*!< CLOCK Root Cko1        */
    kCLOCK_Root_Cko2        = 73, /*!< CLOCK Root Cko2        */
} clock_root_t;

/*!
 * @brief The enumerator of clock roots' clock source mux value.
 */
typedef enum _clock_root_mux_source
{
    /* M7 */
    kCLOCK_M7_ClockRoot_MuxOscRc24M   = 0U, /*!< M7 mux from OscRc24M. */
    kCLOCK_M7_ClockRoot_MuxOscRc400M  = 1U, /*!< M7 mux from OscRc400M. */
    kCLOCK_M7_ClockRoot_MuxArmPllOut  = 2U, /*!< M7 mux from ArmPllOut. */
    kCLOCK_M7_ClockRoot_MuxSysPll3Out = 3U, /*!< M7 mux from SysPll3Out. */

