zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT1189/drivers/fsl_clock.h
    /* M33 */
    kCLOCK_M33_ClockRoot_MuxOscRc24M   = 0U, /*!< M33 mux from OscRc24M. */
    kCLOCK_M33_ClockRoot_MuxOscRc400M  = 1U, /*!< M33 mux from OscRc400M. */
    kCLOCK_M33_ClockRoot_MuxSysPll3Out = 2U, /*!< M33 mux from SysPll3Out. */
    kCLOCK_M33_ClockRoot_MuxArmPllOut  = 3U, /*!< M33 mux from ArmPllOut. */

    /* EDGELOCK */
    kCLOCK_EDGELOCK_ClockRoot_MuxOscRc24M    = 0U, /*!< EDGELOCK mux from OscRc24M. */
    kCLOCK_EDGELOCK_ClockRoot_MuxOscRc400M   = 1U, /*!< EDGELOCK mux from OscRc400M. */
    kCLOCK_EDGELOCK_ClockRoot_MuxSysPll1Out  = 2U, /*!< EDGELOCK mux from SysPll1Out. */
    kCLOCK_EDGELOCK_ClockRoot_MuxSysPll2Pfd1 = 3U, /*!< EDGELOCK mux from SysPll2Pfd1. */

    /* BUS_AON */
    kCLOCK_BUS_AON_ClockRoot_MuxOscRc24M    = 0U, /*!< BUS_AON mux from OscRc24M. */
    kCLOCK_BUS_AON_ClockRoot_MuxOscRc400M   = 1U, /*!< BUS_AON mux from OscRc400M. */
    kCLOCK_BUS_AON_ClockRoot_MuxSysPll2Out  = 2U, /*!< BUS_AON mux from SysPll2Out. */
    kCLOCK_BUS_AON_ClockRoot_MuxSysPll3Pfd2 = 3U, /*!< BUS_AON mux from SysPll3Pfd2. */

    /* BUS_WAKEUP */
    kCLOCK_BUS_WAKEUP_ClockRoot_MuxOscRc24M    = 0U, /*!< BUS_WAKEUP mux from OscRc24M. */
    kCLOCK_BUS_WAKEUP_ClockRoot_MuxOscRc400M   = 1U, /*!< BUS_WAKEUP mux from OscRc400M. */
    kCLOCK_BUS_WAKEUP_ClockRoot_MuxSysPll2Out  = 2U, /*!< BUS_WAKEUP mux from SysPll2Out. */
    kCLOCK_BUS_WAKEUP_ClockRoot_MuxSysPll3Pfd1 = 3U, /*!< BUS_WAKEUP mux from SysPll3Pfd1. */

    /* WAKEUP_AXI */
    kCLOCK_WAKEUP_AXI_ClockRoot_MuxOscRc24M    = 0U, /*!< WAKEUP_AXI mux from OscRc24M. */
    kCLOCK_WAKEUP_AXI_ClockRoot_MuxOscRc400M   = 1U, /*!< WAKEUP_AXI mux from OscRc400M. */
    kCLOCK_WAKEUP_AXI_ClockRoot_MuxSysPll3Out  = 2U, /*!< WAKEUP_AXI mux from SysPll3Out. */
    kCLOCK_WAKEUP_AXI_ClockRoot_MuxSysPll2Pfd1 = 3U, /*!< WAKEUP_AXI mux from SysPll2Pfd1. */

    /* SWO_TRACE */
    kCLOCK_SWO_TRACE_ClockRoot_MuxOscRc24M    = 0U, /*!< SWO_TRACE mux from OscRc24M. */
    kCLOCK_SWO_TRACE_ClockRoot_MuxOscRc400M   = 1U, /*!< SWO_TRACE mux from OscRc400M. */
    kCLOCK_SWO_TRACE_ClockRoot_MuxSysPll3Div2 = 2U, /*!< SWO_TRACE mux from SysPll3Div2. */
    kCLOCK_SWO_TRACE_ClockRoot_MuxSysPll1Div5 = 3U, /*!< SWO_TRACE mux from SysPll1Div5. */

    /* M33_SYSTICK */
    kCLOCK_M33_SYSTICK_ClockRoot_MuxOscRc24M    = 0U, /*!< M33_SYSTICK mux from OscRc24M. */
    kCLOCK_M33_SYSTICK_ClockRoot_MuxOscRc400M   = 1U, /*!< M33_SYSTICK mux from OscRc400M. */
    kCLOCK_M33_SYSTICK_ClockRoot_MuxOsc24MOut   = 2U, /*!< M33_SYSTICK mux from Osc24MOut. */
    kCLOCK_M33_SYSTICK_ClockRoot_MuxSysPll3Div2 = 3U, /*!< M33_SYSTICK mux from SysPll3Div2. */

    /* M7_SYSTICK */
    kCLOCK_M7_SYSTICK_ClockRoot_MuxOscRc24M    = 0U, /*!< M7_SYSTICK mux from OscRc24M. */
    kCLOCK_M7_SYSTICK_ClockRoot_MuxOscRc400M   = 1U, /*!< M7_SYSTICK mux from OscRc400M. */
    kCLOCK_M7_SYSTICK_ClockRoot_MuxOsc24MOut   = 2U, /*!< M7_SYSTICK mux from Osc24MOut. */
    kCLOCK_M7_SYSTICK_ClockRoot_MuxSysPll3Div2 = 3U, /*!< M7_SYSTICK mux from SysPll3Div2. */

    /* FLEXIO1 */
    kCLOCK_FLEXIO1_ClockRoot_MuxOscRc24M    = 0U, /*!< FLEXIO1 mux from OscRc24M. */
    kCLOCK_FLEXIO1_ClockRoot_MuxOscRc400M   = 1U, /*!< FLEXIO1 mux from OscRc400M. */
    kCLOCK_FLEXIO1_ClockRoot_MuxSysPll3Div2 = 2U, /*!< FLEXIO1 mux from SysPll3Div2. */
    kCLOCK_FLEXIO1_ClockRoot_MuxSysPll1Div5 = 3U, /*!< FLEXIO1 mux from SysPll1Div5. */

    /* FLEXIO2 */
    kCLOCK_FLEXIO2_ClockRoot_MuxOscRc24M    = 0U, /*!< FLEXIO2 mux from OscRc24M. */
    kCLOCK_FLEXIO2_ClockRoot_MuxOscRc400M   = 1U, /*!< FLEXIO2 mux from OscRc400M. */
    kCLOCK_FLEXIO2_ClockRoot_MuxSysPll3Div2 = 2U, /*!< FLEXIO2 mux from SysPll3Div2. */
    kCLOCK_FLEXIO2_ClockRoot_MuxSysPll1Div5 = 3U, /*!< FLEXIO2 mux from SysPll1Div5. */

    /* LPIT3 */
    kCLOCK_LPIT3_ClockRoot_MuxOscRc24M    = 0U, /*!< LPIT3 mux from OscRc24M. */
    kCLOCK_LPIT3_ClockRoot_MuxOscRc400M   = 1U, /*!< LPIT3 mux from OscRc400M. */
    kCLOCK_LPIT3_ClockRoot_MuxSysPll3Div2 = 2U, /*!< LPIT3 mux from SysPll3Div2. */
    kCLOCK_LPIT3_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< LPIT3 mux from SysPll2Pfd3. */

    /* LPTIMER1 */
    kCLOCK_LPTIMER1_ClockRoot_MuxOscRc24M    = 0U, /*!< LPTIMER1 mux from OscRc24M. */
    kCLOCK_LPTIMER1_ClockRoot_MuxOscRc400M   = 1U, /*!< LPTIMER1 mux from OscRc400M. */
    kCLOCK_LPTIMER1_ClockRoot_MuxSysPll3Div2 = 2U, /*!< LPTIMER1 mux from SysPll3Div2. */
    kCLOCK_LPTIMER1_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< LPTIMER1 mux from SysPll2Pfd3. */

    /* LPTIMER2 */
    kCLOCK_LPTIMER2_ClockRoot_MuxOscRc24M    = 0U, /*!< LPTIMER2 mux from OscRc24M. */
    kCLOCK_LPTIMER2_ClockRoot_MuxOscRc400M   = 1U, /*!< LPTIMER2 mux from OscRc400M. */
    kCLOCK_LPTIMER2_ClockRoot_MuxSysPll3Div2 = 2U, /*!< LPTIMER2 mux from SysPll3Div2. */
    kCLOCK_LPTIMER2_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< LPTIMER2 mux from SysPll2Pfd3. */

    /* LPTIMER3 */
    kCLOCK_LPTIMER3_ClockRoot_MuxOscRc24M    = 0U, /*!< LPTIMER3 mux from OscRc24M. */
    kCLOCK_LPTIMER3_ClockRoot_MuxOscRc400M   = 1U, /*!< LPTIMER3 mux from OscRc400M. */
    kCLOCK_LPTIMER3_ClockRoot_MuxSysPll3Div2 = 2U, /*!< LPTIMER3 mux from SysPll3Div2. */
    kCLOCK_LPTIMER3_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< LPTIMER3 mux from SysPll2Pfd3. */

    /* TPM2 */
    kCLOCK_TPM2_ClockRoot_MuxOscRc24M    = 0U, /*!< TPM2 mux from OscRc24M. */
    kCLOCK_TPM2_ClockRoot_MuxOscRc400M   = 1U, /*!< TPM2 mux from OscRc400M. */
    kCLOCK_TPM2_ClockRoot_MuxSysPll3Div2 = 2U, /*!< TPM2 mux from SysPll3Div2. */
    kCLOCK_TPM2_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< TPM2 mux from SysPll2Pfd3. */

    /* TPM4 */
    kCLOCK_TPM4_ClockRoot_MuxOscRc24M    = 0U, /*!< TPM4 mux from OscRc24M. */
    kCLOCK_TPM4_ClockRoot_MuxOscRc400M   = 1U, /*!< TPM4 mux from OscRc400M. */
    kCLOCK_TPM4_ClockRoot_MuxSysPll3Div2 = 2U, /*!< TPM4 mux from SysPll3Div2. */
    kCLOCK_TPM4_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< TPM4 mux from SysPll2Pfd3. */

    /* TPM5 */
    kCLOCK_TPM5_ClockRoot_MuxOscRc24M    = 0U, /*!< TPM5 mux from OscRc24M. */
    kCLOCK_TPM5_ClockRoot_MuxOscRc400M   = 1U, /*!< TPM5 mux from OscRc400M. */
    kCLOCK_TPM5_ClockRoot_MuxSysPll3Div2 = 2U, /*!< TPM5 mux from SysPll3Div2. */
    kCLOCK_TPM5_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< TPM5 mux from SysPll2Pfd3. */

    /* TPM6 */
    kCLOCK_TPM6_ClockRoot_MuxOscRc24M    = 0U, /*!< TPM6 mux from OscRc24M. */
    kCLOCK_TPM6_ClockRoot_MuxOscRc400M   = 1U, /*!< TPM6 mux from OscRc400M. */
    kCLOCK_TPM6_ClockRoot_MuxSysPll3Div2 = 2U, /*!< TPM6 mux from SysPll3Div2. */
    kCLOCK_TPM6_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< TPM6 mux from SysPll2Pfd3. */

    /* GPT1 */
    kCLOCK_GPT1_ClockRoot_MuxOscRc24M    = 0U, /*!< GPT1 mux from OscRc24M. */
    kCLOCK_GPT1_ClockRoot_MuxOscRc400M   = 1U, /*!< GPT1 mux from OscRc400M. */
    kCLOCK_GPT1_ClockRoot_MuxSysPll3Div2 = 2U, /*!< GPT1 mux from SysPll3Div2. */
    kCLOCK_GPT1_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< GPT1 mux from SysPll2Pfd3. */

