zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT1189/drivers/fsl_clock.h
    /* GPT2 */
    kCLOCK_GPT2_ClockRoot_MuxOscRc24M    = 0U, /*!< GPT2 mux from OscRc24M. */
    kCLOCK_GPT2_ClockRoot_MuxOscRc400M   = 1U, /*!< GPT2 mux from OscRc400M. */
    kCLOCK_GPT2_ClockRoot_MuxSysPll3Div2 = 2U, /*!< GPT2 mux from SysPll3Div2. */
    kCLOCK_GPT2_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< GPT2 mux from SysPll2Pfd3. */

    /* FLEXSPI1 */
    kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc24M    = 0U, /*!< FLEXSPI1 mux from OscRc24M. */
    kCLOCK_FLEXSPI1_ClockRoot_MuxOscRc400M   = 1U, /*!< FLEXSPI1 mux from OscRc400M. */
    kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll3Pfd0 = 2U, /*!< FLEXSPI1 mux from SysPll3Pfd0. */
    kCLOCK_FLEXSPI1_ClockRoot_MuxSysPll2Pfd0 = 3U, /*!< FLEXSPI1 mux from SysPll2Pfd0. */

    /* FLEXSPI2 */
    kCLOCK_FLEXSPI2_ClockRoot_MuxOscRc24M    = 0U, /*!< FLEXSPI2 mux from OscRc24M. */
    kCLOCK_FLEXSPI2_ClockRoot_MuxOscRc400M   = 1U, /*!< FLEXSPI2 mux from OscRc400M. */
    kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll3Pfd2 = 2U, /*!< FLEXSPI2 mux from SysPll3Pfd2. */
    kCLOCK_FLEXSPI2_ClockRoot_MuxSysPll2Pfd1 = 3U, /*!< FLEXSPI2 mux from SysPll2Pfd1. */

    /* FLEXSPI_SLV */
    kCLOCK_FLEXSPI_SLV_ClockRoot_MuxOscRc24M   = 0U, /*!< FLEXSPI_SLV mux from OscRc24M. */
    kCLOCK_FLEXSPI_SLV_ClockRoot_MuxOscRc400M  = 1U, /*!< FLEXSPI_SLV mux from OscRc400M. */
    kCLOCK_FLEXSPI_SLV_ClockRoot_MuxSysPll2Out = 2U, /*!< FLEXSPI_SLV mux from SysPll2Out. */
    kCLOCK_FLEXSPI_SLV_ClockRoot_MuxSysPll1Out = 3U, /*!< FLEXSPI_SLV mux from SysPll1Out. */

    /* CAN1 */
    kCLOCK_CAN1_ClockRoot_MuxOscRc24M   = 0U, /*!< CAN1 mux from OscRc24M. */
    kCLOCK_CAN1_ClockRoot_MuxOscRc400M  = 1U, /*!< CAN1 mux from OscRc400M. */
    kCLOCK_CAN1_ClockRoot_MuxSysPll3Out = 2U, /*!< CAN1 mux from SysPll3Out. */
    kCLOCK_CAN1_ClockRoot_MuxOsc24MOut  = 3U, /*!< CAN1 mux from Osc24MOut. */

    /* CAN2 */
    kCLOCK_CAN2_ClockRoot_MuxOscRc24M   = 0U, /*!< CAN2 mux from OscRc24M. */
    kCLOCK_CAN2_ClockRoot_MuxOscRc400M  = 1U, /*!< CAN2 mux from OscRc400M. */
    kCLOCK_CAN2_ClockRoot_MuxSysPll3Out = 2U, /*!< CAN2 mux from SysPll3Out. */
    kCLOCK_CAN2_ClockRoot_MuxOsc24MOut  = 3U, /*!< CAN2 mux from Osc24MOut. */

    /* CAN3 */
    kCLOCK_CAN3_ClockRoot_MuxOscRc24M   = 0U, /*!< CAN3 mux from OscRc24M. */
    kCLOCK_CAN3_ClockRoot_MuxOscRc400M  = 1U, /*!< CAN3 mux from OscRc400M. */
    kCLOCK_CAN3_ClockRoot_MuxSysPll3Out = 2U, /*!< CAN3 mux from SysPll3Out. */
    kCLOCK_CAN3_ClockRoot_MuxOsc24MOut  = 3U, /*!< CAN3 mux from Osc24MOut. */

    /* LPUART0102 */
    kCLOCK_LPUART0102_ClockRoot_MuxOscRc24M    = 0U, /*!< LPUART0102 mux from OscRc24M. */
    kCLOCK_LPUART0102_ClockRoot_MuxOscRc400M   = 1U, /*!< LPUART0102 mux from OscRc400M. */
    kCLOCK_LPUART0102_ClockRoot_MuxSysPll3Div2 = 2U, /*!< LPUART0102 mux from SysPll3Div2. */
    kCLOCK_LPUART0102_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< LPUART0102 mux from SysPll2Pfd3. */

    /* LPUART0304 */
    kCLOCK_LPUART0304_ClockRoot_MuxOscRc24M    = 0U, /*!< LPUART0304 mux from OscRc24M. */
    kCLOCK_LPUART0304_ClockRoot_MuxOscRc400M   = 1U, /*!< LPUART0304 mux from OscRc400M. */
    kCLOCK_LPUART0304_ClockRoot_MuxSysPll3Div2 = 2U, /*!< LPUART0304 mux from SysPll3Div2. */
    kCLOCK_LPUART0304_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< LPUART0304 mux from SysPll2Pfd3. */

    /* LPUART0506 */
    kCLOCK_LPUART0506_ClockRoot_MuxOscRc24M    = 0U, /*!< LPUART0506 mux from OscRc24M. */
    kCLOCK_LPUART0506_ClockRoot_MuxOscRc400M   = 1U, /*!< LPUART0506 mux from OscRc400M. */
    kCLOCK_LPUART0506_ClockRoot_MuxSysPll3Div2 = 2U, /*!< LPUART0506 mux from SysPll3Div2. */
    kCLOCK_LPUART0506_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< LPUART0506 mux from SysPll2Pfd3. */

    /* LPUART0708 */
    kCLOCK_LPUART0708_ClockRoot_MuxOscRc24M    = 0U, /*!< LPUART0708 mux from OscRc24M. */
    kCLOCK_LPUART0708_ClockRoot_MuxOscRc400M   = 1U, /*!< LPUART0708 mux from OscRc400M. */
    kCLOCK_LPUART0708_ClockRoot_MuxSysPll3Div2 = 2U, /*!< LPUART0708 mux from SysPll3Div2. */
    kCLOCK_LPUART0708_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< LPUART0708 mux from SysPll2Pfd3. */

    /* LPUART0910 */
    kCLOCK_LPUART0910_ClockRoot_MuxOscRc24M    = 0U, /*!< LPUART0910 mux from OscRc24M. */
    kCLOCK_LPUART0910_ClockRoot_MuxOscRc400M   = 1U, /*!< LPUART0910 mux from OscRc400M. */
    kCLOCK_LPUART0910_ClockRoot_MuxSysPll3Div2 = 2U, /*!< LPUART0910 mux from SysPll3Div2. */
    kCLOCK_LPUART0910_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< LPUART0910 mux from SysPll2Pfd3. */

    /* LPUART1112 */
    kCLOCK_LPUART1112_ClockRoot_MuxOscRc24M    = 0U, /*!< LPUART1112 mux from OscRc24M. */
    kCLOCK_LPUART1112_ClockRoot_MuxOscRc400M   = 1U, /*!< LPUART1112 mux from OscRc400M. */
    kCLOCK_LPUART1112_ClockRoot_MuxSysPll3Div2 = 2U, /*!< LPUART1112 mux from SysPll3Div2. */
    kCLOCK_LPUART1112_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< LPUART1112 mux from SysPll2Pfd3. */

    /* LPI2C0102 */
    kCLOCK_LPI2C0102_ClockRoot_MuxOscRc24M    = 0U, /*!< LPI2C0102 mux from OscRc24M. */
    kCLOCK_LPI2C0102_ClockRoot_MuxOscRc400M   = 1U, /*!< LPI2C0102 mux from OscRc400M. */
    kCLOCK_LPI2C0102_ClockRoot_MuxSysPll3Div2 = 2U, /*!< LPI2C0102 mux from SysPll3Div2. */
    kCLOCK_LPI2C0102_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< LPI2C0102 mux from SysPll2Pfd3. */

    /* LPI2C0304 */
    kCLOCK_LPI2C0304_ClockRoot_MuxOscRc24M    = 0U, /*!< LPI2C0304 mux from OscRc24M. */
    kCLOCK_LPI2C0304_ClockRoot_MuxOscRc400M   = 1U, /*!< LPI2C0304 mux from OscRc400M. */
    kCLOCK_LPI2C0304_ClockRoot_MuxSysPll3Div2 = 2U, /*!< LPI2C0304 mux from SysPll3Div2. */
    kCLOCK_LPI2C0304_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< LPI2C0304 mux from SysPll2Pfd3. */

    /* LPI2C0506 */
    kCLOCK_LPI2C0506_ClockRoot_MuxOscRc24M    = 0U, /*!< LPI2C0506 mux from OscRc24M. */
    kCLOCK_LPI2C0506_ClockRoot_MuxOscRc400M   = 1U, /*!< LPI2C0506 mux from OscRc400M. */
    kCLOCK_LPI2C0506_ClockRoot_MuxSysPll3Div2 = 2U, /*!< LPI2C0506 mux from SysPll3Div2. */
    kCLOCK_LPI2C0506_ClockRoot_MuxSysPll2Pfd3 = 3U, /*!< LPI2C0506 mux from SysPll2Pfd3. */

    /* LPSPI0102 */
    kCLOCK_LPSPI0102_ClockRoot_MuxOscRc24M    = 0U, /*!< LPSPI0102 mux from OscRc24M. */
    kCLOCK_LPSPI0102_ClockRoot_MuxOscRc400M   = 1U, /*!< LPSPI0102 mux from OscRc400M. */
    kCLOCK_LPSPI0102_ClockRoot_MuxSysPll3Pfd1 = 2U, /*!< LPSPI0102 mux from SysPll3Pfd1. */
    kCLOCK_LPSPI0102_ClockRoot_MuxSysPll2Out  = 3U, /*!< LPSPI0102 mux from SysPll2Out. */

