zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT1189/drivers/fsl_clock.h
    /* SERDES0_1G */
    kCLOCK_SERDES0_1G_ClockRoot_MuxOscRc24M    = 0U, /*!< SERDES0_1G mux from OscRc24M. */
    kCLOCK_SERDES0_1G_ClockRoot_MuxOscRc400M   = 1U, /*!< SERDES0_1G mux from OscRc400M. */
    kCLOCK_SERDES0_1G_ClockRoot_MuxSysPll1Out  = 2U, /*!< SERDES0_1G mux from SysPll1Out. */
    kCLOCK_SERDES0_1G_ClockRoot_MuxAudioPllOut = 3U, /*!< SERDES0_1G mux from AudioPllOut. */

    /* SERDES1_1G */
    kCLOCK_SERDES1_1G_ClockRoot_MuxOscRc24M    = 0U, /*!< SERDES1_1G mux from OscRc24M. */
    kCLOCK_SERDES1_1G_ClockRoot_MuxOscRc400M   = 1U, /*!< SERDES1_1G mux from OscRc400M. */
    kCLOCK_SERDES1_1G_ClockRoot_MuxSysPll1Out  = 2U, /*!< SERDES1_1G mux from SysPll1Out. */
    kCLOCK_SERDES1_1G_ClockRoot_MuxAudioPllOut = 3U, /*!< SERDES1_1G mux from AudioPllOut. */

    /* SERDES2_1G */
    kCLOCK_SERDES2_1G_ClockRoot_MuxOscRc24M    = 0U, /*!< SERDES2_1G mux from OscRc24M. */
    kCLOCK_SERDES2_1G_ClockRoot_MuxOscRc400M   = 1U, /*!< SERDES2_1G mux from OscRc400M. */
    kCLOCK_SERDES2_1G_ClockRoot_MuxSysPll1Out  = 2U, /*!< SERDES2_1G mux from SysPll1Out. */
    kCLOCK_SERDES2_1G_ClockRoot_MuxAudioPllOut = 3U, /*!< SERDES2_1G mux from AudioPllOut. */

    /* XCELBUSX */
    kCLOCK_XCELBUSX_ClockRoot_MuxOscRc24M    = 0U, /*!< XCELBUSX mux from OscRc24M. */
    kCLOCK_XCELBUSX_ClockRoot_MuxOscRc400M   = 1U, /*!< XCELBUSX mux from OscRc400M. */
    kCLOCK_XCELBUSX_ClockRoot_MuxSysPll3Out  = 2U, /*!< XCELBUSX mux from SysPll3Out. */
    kCLOCK_XCELBUSX_ClockRoot_MuxSysPll3Pfd1 = 3U, /*!< XCELBUSX mux from SysPll3Pfd1. */

    /* XRIOCU4 */
    kCLOCK_XRIOCU4_ClockRoot_MuxOscRc24M    = 0U, /*!< XRIOCU4 mux from OscRc24M. */
    kCLOCK_XRIOCU4_ClockRoot_MuxOscRc400M   = 1U, /*!< XRIOCU4 mux from OscRc400M. */
    kCLOCK_XRIOCU4_ClockRoot_MuxOsc24MOut   = 2U, /*!< XRIOCU4 mux from Osc24MOut. */
    kCLOCK_XRIOCU4_ClockRoot_MuxSysPll3Div2 = 3U, /*!< XRIOCU4 mux from SysPll3Div2. */

    /* MCTRL */
    kCLOCK_MCTRL_ClockRoot_MuxOscRc24M    = 0U, /*!< MCTRL mux from OscRc24M. */
    kCLOCK_MCTRL_ClockRoot_MuxOscRc400M   = 1U, /*!< MCTRL mux from OscRc400M. */
    kCLOCK_MCTRL_ClockRoot_MuxSysPll1Div5 = 2U, /*!< MCTRL mux from SysPll1Div5. */
    kCLOCK_MCTRL_ClockRoot_MuxAudioPllOut = 3U, /*!< MCTRL mux from AudioPllOut. */

    /* SAI1 */
    kCLOCK_SAI1_ClockRoot_MuxOscRc24M    = 0U, /*!< SAI1 mux from OscRc24M. */
    kCLOCK_SAI1_ClockRoot_MuxOscRc400M   = 1U, /*!< SAI1 mux from OscRc400M. */
    kCLOCK_SAI1_ClockRoot_MuxAudioPllOut = 2U, /*!< SAI1 mux from AudioPllOut. */
    kCLOCK_SAI1_ClockRoot_MuxSysPll3Pfd2 = 3U, /*!< SAI1 mux from SysPll3Pfd2. */

    /* SAI2 */
    kCLOCK_SAI2_ClockRoot_MuxOscRc24M    = 0U, /*!< SAI2 mux from OscRc24M. */
    kCLOCK_SAI2_ClockRoot_MuxOscRc400M   = 1U, /*!< SAI2 mux from OscRc400M. */
    kCLOCK_SAI2_ClockRoot_MuxAudioPllOut = 2U, /*!< SAI2 mux from AudioPllOut. */
    kCLOCK_SAI2_ClockRoot_MuxSysPll3Pfd2 = 3U, /*!< SAI2 mux from SysPll3Pfd2. */

    /* SAI3 */
    kCLOCK_SAI3_ClockRoot_MuxOscRc24M    = 0U, /*!< SAI3 mux from OscRc24M. */
    kCLOCK_SAI3_ClockRoot_MuxOscRc400M   = 1U, /*!< SAI3 mux from OscRc400M. */
    kCLOCK_SAI3_ClockRoot_MuxAudioPllOut = 2U, /*!< SAI3 mux from AudioPllOut. */
    kCLOCK_SAI3_ClockRoot_MuxSysPll3Pfd2 = 3U, /*!< SAI3 mux from SysPll3Pfd2. */

    /* SAI4 */
    kCLOCK_SAI4_ClockRoot_MuxOscRc24M    = 0U, /*!< SAI4 mux from OscRc24M. */
    kCLOCK_SAI4_ClockRoot_MuxOscRc400M   = 1U, /*!< SAI4 mux from OscRc400M. */
    kCLOCK_SAI4_ClockRoot_MuxAudioPllOut = 2U, /*!< SAI4 mux from AudioPllOut. */
    kCLOCK_SAI4_ClockRoot_MuxSysPll3Pfd2 = 3U, /*!< SAI4 mux from SysPll3Pfd2. */

    /* SPDIF */
    kCLOCK_SPDIF_ClockRoot_MuxOscRc24M    = 0U, /*!< SPDIF mux from OscRc24M. */
    kCLOCK_SPDIF_ClockRoot_MuxOscRc400M   = 1U, /*!< SPDIF mux from OscRc400M. */
    kCLOCK_SPDIF_ClockRoot_MuxAudioPllOut = 2U, /*!< SPDIF mux from AudioPllOut. */
    kCLOCK_SPDIF_ClockRoot_MuxSysPll3Pfd2 = 3U, /*!< SPDIF mux from SysPll3Pfd2. */

    /* ASRC */
    kCLOCK_ASRC_ClockRoot_MuxOscRc24M    = 0U, /*!< ASRC mux from OscRc24M. */
    kCLOCK_ASRC_ClockRoot_MuxOscRc400M   = 1U, /*!< ASRC mux from OscRc400M. */
    kCLOCK_ASRC_ClockRoot_MuxSysPll3Out  = 2U, /*!< ASRC mux from SysPll3Out. */
    kCLOCK_ASRC_ClockRoot_MuxAudioPllOut = 3U, /*!< ASRC mux from AudioPllOut. */

    /* MIC */
    kCLOCK_MIC_ClockRoot_MuxOscRc24M    = 0U, /*!< MIC mux from OscRc24M. */
    kCLOCK_MIC_ClockRoot_MuxOscRc400M   = 1U, /*!< MIC mux from OscRc400M. */
    kCLOCK_MIC_ClockRoot_MuxSysPll3Div2 = 2U, /*!< MIC mux from SysPll3Div2. */
    kCLOCK_MIC_ClockRoot_MuxAudioPllOut = 3U, /*!< MIC mux from AudioPllOut. */

    /* CKO1 */
    kCLOCK_CKO1_ClockRoot_MuxOscRc24M    = 0U, /*!< CKO1 mux from OscRc24M. */
    kCLOCK_CKO1_ClockRoot_MuxOscRc400M   = 1U, /*!< CKO1 mux from OscRc400M. */
    kCLOCK_CKO1_ClockRoot_MuxSysPll3Div2 = 2U, /*!< CKO1 mux from SysPll3Div2. */
    kCLOCK_CKO1_ClockRoot_MuxSysPll1Div2 = 3U, /*!< CKO1 mux from SysPll1Div2. */

    /* CKO2 */
    kCLOCK_CKO2_ClockRoot_MuxOscRc24M    = 0U, /*!< CKO2 mux from OscRc24M. */
    kCLOCK_CKO2_ClockRoot_MuxOscRc400M   = 1U, /*!< CKO2 mux from OscRc400M. */
    kCLOCK_CKO2_ClockRoot_MuxSysPll1Div5 = 2U, /*!< CKO2 mux from SysPll1Div5. */
    kCLOCK_CKO2_ClockRoot_MuxArmPllOut   = 3U, /*!< CKO2 mux from ArmPllOut. */
} clock_root_mux_source_t;

#define clock_ip_name_t clock_lpcg_t

#if (__CORTEX_M == 7)
#define CLOCK_GetCpuClkFreq CLOCK_GetM7Freq
#else
#define CLOCK_GetCpuClkFreq CLOCK_GetM33Freq
#endif

#define CLOCK_GetCoreSysClkFreq CLOCK_GetCpuClkFreq /*!< For compatible with other platforms without CCM. */

/* uncomment the following line if want to use OBS to retrieve frequency */
/* #define GET_FREQ_FROM_OBS */

/*! @brief OSC 24M sorce select */
typedef enum _clock_osc
{
    kCLOCK_RcOsc   = 0U, /*!< On chip OSC. */
    kCLOCK_XtalOsc = 1U, /*!< 24M Xtal OSC */
} clock_osc_t;

/*! @brief Clock gate value */
typedef enum _clock_gate_value
{
    kCLOCK_Off = (int)~CCM_LPCG_DIRECT_ON_MASK, /*!< Clock is off. */
    kCLOCK_On  = CCM_LPCG_DIRECT_ON_MASK,       /*!< Clock is on*/
} clock_gate_value_t;

/*! @brief System clock mode */
typedef enum _clock_mode_t
{
    kCLOCK_ModeRun  = 0U, /*!< Remain in run mode. */
    kCLOCK_ModeWait = 1U, /*!< Transfer to wait mode. */
    kCLOCK_ModeStop = 2U, /*!< Transfer to stop mode. */
} clock_mode_t;

